Autodesk.Revit.DB.ExportPaperFormat
Paper formats supported by DWF export

Autodesk.Revit.DB.ExportPaperFormat.ARCH_E3
ARCH E3, 27 x 39 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_E2
ARCH E2, 26 x 38 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_E1
ARCH E1, 30 x 42 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_E
ARCH E, 36 x 48 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_D
ARCH D, 24 x 36 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_C
ARCH C, 18 x 24 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_B
ARCH B, 12 x 18 in

Autodesk.Revit.DB.ExportPaperFormat.ARCH_A
ARCH A, 9 x 12 in

Autodesk.Revit.DB.ExportPaperFormat.ISO_B1
ISO B1, 707 x 1000 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_B2
ISO B2, 500 x 707 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_B3
ISO B3, 353 x 500 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_B4
ISO B4, 250 x 353 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_A0
ISO A0, 841 x 1189 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_A1
ISO A1, 594 x 841 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_A2
ISO A2, 420 x 594 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_A3
ISO A3, 297 x 420 mm

Autodesk.Revit.DB.ExportPaperFormat.ISO_A4
ISO A4, 210 x 297 mm

Autodesk.Revit.DB.ExportPaperFormat.ANSI_E
ANSI E, 34 x 44 in

Autodesk.Revit.DB.ExportPaperFormat.ANSI_D
ANSI D, 22 x 34 in

Autodesk.Revit.DB.ExportPaperFormat.ANSI_C
ANSI C, 17 x 22 in

Autodesk.Revit.DB.ExportPaperFormat.ANSI_B
ANSI B, 11 x 17 in

Autodesk.Revit.DB.ExportPaperFormat.ANSI_A
ANSI A, 8.5 x 11 in

Autodesk.Revit.DB.ExportPaperFormat.Default
Default paper format.
Remarks: Default size depends on the sheet set going to
be exported. If all sheets are of type DrawingSheet, then
paper sizes are properly adjusted to their respective
content with zoom level set to 100%. If views of type other
than DrawingSheet are in the export set, the default paper
size is UI-Letter and zoom is set to fit-the-page.